Catalogs/КадровыйРезерв.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>КадровыйРезерв</Name>
			<Comment>АПК:58 Различия имени и синонима оправданы</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НазначенияКадровогоРезерва</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПозицияШтатногоРасписания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Требования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинимальныйВозраст</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальныйВозраст</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСтажа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыСтажа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинимальныйСтажМесяцев</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальныйСтажМесяцев</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбразования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОбразованияФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Специальность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСпециальностейПоОбразованию</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПродолжительностьПланаОбучения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерностьПродолжительностиПланаОбучения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрофильДолжности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрофилиДолжностей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Должности</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДействияСотрудников</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДействиеСотрудника</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДействияСотрудников</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПрограммаОбучения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Мероприятие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МероприятияОбученияРазвития</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начало</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Окончание</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ХарактеристикиПерсонала</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ХарактеристикиПерсонала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗначенияХарактеристик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьЗначение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ХарактеристикиПерсонала</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдалитьКомпетенции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Компетенция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КомпетенцииПерсонала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МинимальныйУровень</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УровниКомпетенцийПерсонала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подразделения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/НазначенияКадровогоРезерва.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>НазначенияКадровогоРезерва</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПозицияШтатногоРасписания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГруппаКадровогоРезерва</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КатегорияГруппаДолжностей</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СостоянияСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СостоянияСогласования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рассматривается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласовано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Готовится</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапланированоОбучение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/КлассификаторСпециальностейПоОбразованию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>КлассификаторСпециальностейПоОбразованию</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ДействияСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ДействияСотрудников</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ХарактеристикиПерсонала</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ХарактеристикиПерсонала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗначенияХарактеристик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТребуетсяПроверка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТребуетсяОбучение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВесЗначения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьЗначение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ХарактеристикиПерсонала</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/КадровыйРезерв/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПросмотрСостава = Параметры.ПросмотрСостава;
	
	// Начальное заполнение
	Если Параметры.Ключ.Пустая() Тогда
		ЗначенияДляЗаполнения = Новый Структура("Ответственный", "Объект.Ответственный");
		ЗарплатаКадры.ЗаполнитьПервоначальныеЗначенияВФорме(ЭтотОбъект, ЗначенияДляЗаполнения);
		УстановитьНаименованиеНаСервере();
		Если ЗначениеЗаполнено(Параметры.ПозицияШтатногоРасписания) Тогда
			Объект.ПозицияШтатногоРасписания = Параметры.ПозицияШтатногоРасписания;
			Объект.Назначение = Перечисления.НазначенияКадровогоРезерва.ПозицияШтатногоРасписания;
		КонецЕсли;
		ПриПолученииДанныхНаСервере();
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	ДополнительныеПараметры.Вставить("ОтложеннаяИнициализация", Истина);
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ПриПолученииДанныхНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ЗаполнитьДанныеОбъектаПоВторичнымДаннымФормы();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ХарактеристикиПерсоналаФормы.ПеренестиХарактеристикиВТабличнуюЧасть(ТекущийОбъект.ХарактеристикиПерсонала,
		Характеристики, ЗначенияХарактеристики);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.КадровыйРезерв.КадровыйРезервГосслужащих") Тогда
		МодульКадровыйРезервГосслужащих = ОбщегоНазначения.ОбщийМодуль("КадровыйРезервГосслужащих");
		МодульКадровыйРезервГосслужащих.ПриЗаписиИзФормыПозицииКадровогоРезерва(ЭтотОбъект, ТекущийОбъект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ЗаписанаПозицияКадровогоРезерва");
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ПриПолученииДанныхНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	Если Источник = ЭтотОбъект И ИмяСобытия = "ИзмененыДолжности" Тогда
		ЗагрузитьДолжностиНаСервере(Параметр.Должности);
		УстановитьИнфоДолжности(ЭтотОбъект);
	ИначеЕсли ИмяСобытия = "ЗаписанаЗаявкаНаВключениеВКадровыйРезерв" Тогда
		Элементы.СписокРезервистов.Обновить();
	ИначеЕсли ИмяСобытия = "ЗаписаноВключениеВКадровыйРезерв" Тогда
		Элементы.СписокРезервистов.Обновить();
	ИначеЕсли ИмяСобытия = "ЗаписаноИсключениеИзКадровогоРезерва" Тогда
		Элементы.СписокРезервистов.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.КадровыйРезерв.КадровыйРезервГосслужащих") Тогда
		МодульКадровыйРезервГосслужащих = ОбщегоНазначения.ОбщийМодуль("КадровыйРезервГосслужащих");
		МодульКадровыйРезервГосслужащих.ПриПроверкеЗаполненияВФормеПозицииКадровогоРезерва(ЭтотОбъект, Отказ,
			ПроверяемыеРеквизиты);
	КонецЕсли;
	
	ХарактеристикиПерсоналаФормы.ОбработкаПроверкиЗаполненияТабличныхЧастейХарактеристик(ЭтотОбъект, Отказ,
		ПроверяемыеРеквизиты);
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	Если Не ТекущийОбъект.ПроверитьЗаполнение() Тогда
		ОбработатьСообщенияПользователю();
		Отказ = Истина
	КонецЕсли;	
	ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "Объект");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОграничиватьМинимальныйВозрастПриИзменении(Элемент)
	УстановитьДоступностьМинимальногоВозраста(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОграничиватьМаксимальныйВозрастПриИзменении(Элемент)
	УстановитьДоступностьМаксимальногоВозраста(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОграничиватьМинимальныйСтажПриИзменении(Элемент)
	УстановитьДоступностьМинимальногоСтажа(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОграничиватьМаксимальныйСтажПриИзменении(Элемент)
	УстановитьДоступностьМаксимальногоСтажа(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура НазначениеПриИзменении(Элемент)
	
	Если Объект.Назначение <> ПредопределенноеЗначение("Перечисление.НазначенияКадровогоРезерва.ГруппаКадровогоРезерва") Тогда
		Объект.Должности.Очистить();
		Объект.Подразделения.Очистить();
		Объект.ПрофильДолжности = Неопределено;
		УстановитьИнфоДолжности(ЭтотОбъект);
	КонецЕсли;
	
	Если Объект.Назначение <> ПредопределенноеЗначение("Перечисление.НазначенияКадровогоРезерва.ПозицияШтатногоРасписания") Тогда
		Объект.ПозицияШтатногоРасписания = ПредопределенноеЗначение("Справочник.ШтатноеРасписание.ПустаяСсылка");
		ПредыдущаяПозицияШтатногоРасписания = Объект.ПозицияШтатногоРасписания;
	КонецЕсли;
	
	УстановитьВидимостьЭлементовНазначения();
	
КонецПроцедуры

&НаКлиенте
Процедура ПозицияШтатногоРасписанияПриИзменении(Элемент)
	УстановитьНаименованиеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ИнфоДолжностиОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьДолжности" Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура("ТаблицаДолжностей", АдресДолжностей());
		ПараметрыФормы.Вставить("Подразделения", ПодразделенияДолжностей());
		ОткрытьФорму("Справочник.КадровыйРезерв.Форма.ФормаЗаполненияДолжностей", ПараметрыФормы, ЭтотОбъект,
			Новый УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПозицияШтатногоРасписанияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокПозиций = СписокУжеСозданныхПозицийШтатногоРасписанияНаСервере(Объект.Ссылка);
	АдресСпискаПодобранныхПозиций = АдресДанныхВХранилище(СписокПозиций);
	ПараметрыФормы = Новый Структура("РежимВыбора, ЗакрыватьПриВыборе, АдресСпискаПодобранных", Истина, Истина,
		АдресСпискаПодобранныхПозиций);
	ОткрытьФорму("Справочник.ШтатноеРасписание.ФормаВыбора", ПараметрыФормы, Элементы.ПозицияШтатногоРасписания); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПозицияШтатногоРасписанияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	УстановитьПодсказкуПоляПозицияШтатногоРасписания(ВыбранноеЗначение);
КонецПроцедуры

&НаКлиенте
Процедура ПозицияШтатногоРасписанияОчистка(Элемент, СтандартнаяОбработка)
	УстановитьПодсказкуПоляПозицияШтатногоРасписания(Объект.ПозицияШтатногоРасписания);
КонецПроцедуры

&НаКлиенте
Процедура ПродолжительностьПланаОбученияПриИзменении(Элемент)
	ОбучениеРазвитиеКлиент.ПриИзмененииПродолжительностиПланаОбучения(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	// СтандартныеПодсистемы.Свойства
	Если ЭтотОбъект.ПараметрыСвойств.Свойство(ТекущаяСтраница.Имя)
		И Не ЭтотОбъект.ПараметрыСвойств.ВыполненаОтложеннаяИнициализация Тогда
		
		СвойстваВыполнитьОтложеннуюИнициализацию();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ОграничиватьОбразованиеПриИзменении(Элемент)
	УстановитьДоступностьОбразования(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ВидСтажаПриИзменении(Элемент)
	
	УстановитьФлагиОграничителиСтажа(ЭтотОбъект);
	УстановитьДоступностьОграничителейСтажа(ЭтотОбъект);
	УстановитьДоступностьМинимальногоСтажа(ЭтотОбъект);
	УстановитьДоступностьМаксимальногоСтажа(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокРезервистов

&НаКлиенте
Процедура СписокРезервистовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	КадровыйРезервКлиент.ОткрытьФормуУчастникаКадровогоРезерва(ЭтотОбъект, "СписокРезервистов");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыХарактеристикиПерсонала

&НаКлиенте
Процедура ХарактеристикиПерсоналаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Поле.Имя <> "ХарактеристикиПерсоналаЗначение" И Поле.Имя <> "ХарактеристикиПерсоналаХарактеристика" Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ХарактеристикиПерсонала.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Или Не ЗначениеЗаполнено(ТекущиеДанные.Характеристика) Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле.Имя = "ХарактеристикиПерсоналаЗначение" Тогда
		ХарактеристикиПерсоналаКлиент.ОткрытьНастройкуЗначенийХарактеристик(ЭтотОбъект, ТекущиеДанные.Характеристика,
			"Вес", "ЗаполнитьДеревоХарактеристикНаКлиенте");
	ИначеЕсли Поле.Имя = "ХарактеристикиПерсоналаХарактеристика" Тогда
		ПоказатьЗначение(, ТекущиеДанные.Характеристика);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ХарактеристикиПерсоналаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	ХарактеристикиПерсоналаКлиент.ОткрытьФормуДобавленияХарактеристик(ЭтотОбъект, Копирование, Отказ,
		Новый ОписаниеОповещения("ДобавитьХарактеристикиПерсоналаНаКлиенте", ЭтотОбъект));
КонецПроцедуры

&НаКлиенте
Процедура ХарактеристикиПерсоналаПередУдалением(Элемент, Отказ)
	ХарактеристикиПерсоналаКлиент.УдалитьЗначенияХарактеристик(ЭтотОбъект,
		Элементы.ХарактеристикиПерсонала.ВыделенныеСтроки);
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовТаблицыФормыПрограммаОбучения

&НаКлиенте
Процедура ПрограммаОбученияПриИзменении(Элемент)
	ОбучениеРазвитиеКлиент.ПрограммаОбученияПриИзменении(ЭтотОбъект, Элемент, Элементы.ПрограммаОбучения);
КонецПроцедуры

&НаКлиенте
Процедура ПрограммаОбученияМероприятиеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПрограммаОбучения.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьВторичныеДанныеОбученияНаСервере(ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДействияСотрудников

&НаКлиенте
Процедура ДействияСотрудниковВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПоказатьЗначение(, Элементы.ДействияСотрудников.ТекущиеДанные.ДействиеСотрудника);
КонецПроцедуры

&НаКлиенте
Процедура ДействияСотрудниковПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	ОткрытьПодборФункций();
КонецПроцедуры

&НаКлиенте
Процедура ДействияСотрудниковПередУдалением(Элемент, Отказ)
	ХарактеристикиПерсоналаКлиент.ДействияСотрудниковПередУдалением(ЭтотОбъект, "ЗаполнитьДеревоХарактеристикНаКлиенте");
КонецПроцедуры

&НаКлиенте
Процедура ДействияСотрудниковОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицуИзМассива(
		Объект.ДействияСотрудников, ВыбранноеЗначение, "ДействиеСотрудника");
	
	ДобавитьХарактеристикиИзДействийНаСервере(ВыбранноеЗначение);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодборФункций(Команда)
	
	ОткрытьПодборФункций();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьПоТребованиям(Команда)
	
	ПараметрыФормы = Новый Структура("ПозицияРезерва", Объект.Ссылка);
	ЗаполнитьУстановленныеПараметры(ПараметрыФормы);
	
	ОткрытьФорму("Справочник.КадровыйРезерв.Форма.ФормаПодбораКандидатовПоТребованиям", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено,
	СтандартнаяОбработка = Неопределено)
	
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ЗаявкаНаВключениеВКадровыйРезерв(Команда)
	
	ПараметрыФормы = Новый Структура("ПозицияРезерва", Объект.Ссылка);
	КадровыйРезервКлиент.ОткрытьФормуЗаявкаНаВключениеВКадровыйРезерв(ЭтотОбъект, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВключениеВКадровыйРезерв(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПозицияРезерва", Объект.Ссылка);
	ТекущиеДанные = Элементы.СписокРезервистов.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено И ТекущиеДанные.Состояние = "Кандидат" Тогда
		ПараметрыФормы.Вставить("УчастникКадровогоРезерва", ТекущиеДанные.УчастникКадровогоРезерва);
		ПараметрыФормы.Вставить("ВидРезерва", ТекущиеДанные.ВидРезерва);
	КонецЕсли;
	КадровыйРезервКлиент.ОткрытьФормуВключениеВКадровыйРезерв(ЭтотОбъект, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ИсключениеИзКадровогоРезерва(Команда)
	
	ТекущиеДанные = Элементы.СписокРезервистов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("УчастникКадровогоРезерва", ТекущиеДанные.УчастникКадровогоРезерва);
	КадровыйРезервКлиент.ОткрытьФормуИсключениеИзКадровогоРезерва(ЭтотОбъект, ПараметрыФормы);
	
КонецПроцедуры

#Область ОбработчикиКомандРейтинга

&НаКлиенте
Процедура Подключаемый_Рейтинг1(Команда)
	ПоставитьРейтингНаКлиенте(1);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_Рейтинг2(Команда)
	ПоставитьРейтингНаКлиенте(2);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_Рейтинг3(Команда)
	ПоставитьРейтингНаКлиенте(3);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_Рейтинг4(Команда)
	ПоставитьРейтингНаКлиенте(4);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_Рейтинг5(Команда)
	ПоставитьРейтингНаКлиенте(5);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РейтингСбросить(Команда)
	ПоставитьРейтингНаКлиенте(0);
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ПодобратьХарактеристики(Команда)
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("ДобавлятьЗначенияХарактеристик", Истина);
	
	ХарактеристикиПерсоналаКлиент.ОткрытьФормуПодбораХарактеристик(
		ЭтотОбъект,
		ПараметрыПодбора,
		Новый ОписаниеОповещения("ДобавитьХарактеристикиПерсоналаНаКлиенте", ЭтотОбъект),
		"Вес,ТребуетсяОбучение,ТребуетсяПроверка");
		
КонецПроцедуры

&НаКлиенте
Процедура ПоКомпетенциям(Команда)
	
	Элементы.ХарактеристикиПерсоналаПоКомпетенциям.Пометка = НЕ Элементы.ХарактеристикиПерсоналаПоКомпетенциям.Пометка;
	
	УстановитьСвойстваЭлементовХарактеристикПерсонала(ЭтотОбъект);
	
	ЗаполнитьДеревоХарактеристикНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДействияИзПрофиляДолжности(Команда)
	
	Если Объект.ДействияСотрудников.Количество() > 0 Тогда
		
		ТекстВопроса = НСтр("ru = 'Список действий не пустой. При заполнении он будет очищен. Продолжить?'");
		ОбработчикОповещенияОЗакрытии = Новый ОписаниеОповещения("ЗаполнитьДействияСотрудниковЗавершение", ЭтотОбъект);
		
		ПоказатьВопрос(ОбработчикОповещенияОЗакрытии,ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да,
			НСтр("ru = 'Продолжить?'"));
		
	Иначе
		ЗаполнитьДействияСотрудниковЗавершение(КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПрограммуОбученияИзПрофиляДолжности(Команда)
	
	Если Объект.ПрограммаОбучения.Количество() > 0 Тогда
		ТекстВопроса = НСтр("ru = 'Программа обучения будет заменена программой из профиля должности.
			|Продолжить?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьПрограммуОбученияПоПрофилюЗавершение", ЭтотОбъект),
			ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьПрограммуОбученияПоПрофилюНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПодборПрограммыОбученияПоХарактеристикам(Команда)
	
	СписокСкрываемыхРеквизитов = Новый Структура;
	СписокСкрываемыхРеквизитов.Вставить("ТребуетсяОбучение");
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("АдресХарактеристикПерсонала", АдресХарактеристикПерсонала());
	СтруктураПараметров.Вставить("АдресПрограммыОбучения", АдресПрограммыОбучения());
	СтруктураПараметров.Вставить("СкрытьРеквизиты", СписокСкрываемыхРеквизитов);
	
	ОбучениеРазвитиеКлиент.ОткрытьФормуПодбораПрограммыОбучения(
		ЭтотОбъект,
		Новый Структура("ПараметрыФормыПодбора", СтруктураПараметров),
		Новый ОписаниеОповещения("ЗагрузитьПрограммуОбученияНаКлиенте", ЭтотОбъект));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДолжности(Элемент)
	
	ПриИзмененииДолжностиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииДолжностиНаСервере()

	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.КадровыйРезерв.КадровыйРезервГосслужащих") Тогда
		МодульКадровыйРезервГосслужащих = ОбщегоНазначения.ОбщийМодуль("КадровыйРезервГосслужащих");
		МодульКадровыйРезервГосслужащих.ПриИзмененииДолжностиВФормеПозицииКадровогоРезерва(ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СвойстваВыполнитьОтложеннуюИнициализацию()
	УправлениеСвойствами.ЗаполнитьДополнительныеРеквизитыВФорме(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура ЗаполнитьДанныеОбъектаПоВторичнымДаннымФормы()
	
	// Заполним стаж.
	Объект.МинимальныйСтажМесяцев = МинимальныйСтажЛет*12 + МинимальныйСтажМесяцев;
	Объект.МаксимальныйСтажМесяцев = МаксимальныйСтажЛет*12 + МаксимальныйСтажМесяцев;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВторичныеРеквизитыФормы()

	ИспользуютсяЗаявкиНаВключениеВРезерв = ПолучитьФункциональнуюОпцию("ИспользоватьЗаявкиНаВключениеВКадровыйРезерв");
	
	ПредыдущаяПозицияШтатногоРасписания = Объект.ПозицияШтатногоРасписания;
	
	УстановитьПараметрДинамическогоСпискаРезервистов(ЭтотОбъект, ТекущаяДатаСеанса());
	УстановитьСтаж(ЭтотОбъект);
	УстановитьИнфоДолжности(ЭтотОбъект);
	УстановитьФлагиОграничителиВозраста(ЭтотОбъект);
	УстановитьФлагиОграничителиОбразования(ЭтотОбъект);
	УстановитьФлагиОграничителиСтажа(ЭтотОбъект);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПараметрДинамическогоСпискаРезервистов(Форма, ТекущаяДата)

	Статусы = Новый Массив;
	Если Форма.ИспользуютсяЗаявкиНаВключениеВРезерв Тогда
		Статусы.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияСогласования.Рассматривается"));
	КонецЕсли;
	Статусы.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияСогласования.Согласовано"));
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Форма.СписокРезервистов,
		"Статусы",
		Статусы,
		Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Форма.СписокРезервистов,
		"Ссылка",
		Форма.Объект.Ссылка,
		Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Форма.СписокРезервистов,
		"ТекущаяДата",
		ТекущаяДата,
		Истина);

КонецПроцедуры

&НаСервере
Процедура СкрытьСтраницуТребований()

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТребованияСтраница", "Видимость", Ложь);
		
КонецПроцедуры

&НаСервере
Процедура УстановитьСвойстваРеквизитовТребований()

	Если ПросмотрСостава Тогда
		СкрытьСтраницуТребований();
		Возврат;
	КонецЕсли;
	
	УстановитьДоступностьМинимальногоВозраста(ЭтотОбъект);
	УстановитьДоступностьМаксимальногоВозраста(ЭтотОбъект);
	УстановитьДоступностьОбразования(ЭтотОбъект);
	УстановитьДоступностьОграничителейСтажа(ЭтотОбъект);
	УстановитьДоступностьМинимальногоСтажа(ЭтотОбъект);
	УстановитьДоступностьМаксимальногоСтажа(ЭтотОбъект);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСтаж(Форма)

	ОбъектФормы = Форма.Объект;
	
	Если ЗначениеЗаполнено(ОбъектФормы.ВидСтажа) Тогда
		Форма.МинимальныйСтажЛет = Цел(ОбъектФормы.МинимальныйСтажМесяцев/12);
		Форма.МинимальныйСтажМесяцев = ОбъектФормы.МинимальныйСтажМесяцев - Форма.МинимальныйСтажЛет*12;
		Форма.МаксимальныйСтажЛет = Цел(ОбъектФормы.МаксимальныйСтажМесяцев/12);
		Форма.МаксимальныйСтажМесяцев = ОбъектФормы.МаксимальныйСтажМесяцев - Форма.МаксимальныйСтажЛет*12;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьИнфоДолжности(Форма)
	
	ДолжностиТЧ = Форма.Объект.Должности;
	
	Если ДолжностиТЧ.Количество() = 0 Тогда
		Форма.ИнфоДолжности = Новый ФорматированнаяСтрока(НСтр("ru = 'Заполнить список'"),,,,"ОткрытьДолжности");
	Иначе
		МассивСтрок = Новый Массив;
		Для каждого СтрокаДолжности Из ДолжностиТЧ Цикл
			Если МассивСтрок.Количество() >= 3  Тогда // то есть есть уже должность + запятая + еще одна должность.
				Прервать;
			КонецЕсли;
		    МассивСтрок.Добавить(Новый ФорматированнаяСтрока(Строка(СтрокаДолжности.Должность)));
			Если ДолжностиТЧ.Индекс(СтрокаДолжности) = 0 И ДолжностиТЧ.Количество() > 1 Тогда
				МассивСтрок.Добавить(Новый ФорматированнаяСтрока(", "));
			КонецЕсли;
		КонецЦикла; 
		Если ДолжностиТЧ.Количество() > 2 Тогда
			ДопТекст = " " + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'и еще %1'"),
				ДолжностиТЧ.Количество() - 2);
			МассивСтрок.Добавить(Новый ФорматированнаяСтрока(ДопТекст));
		КонецЕсли;	
		Форма.ИнфоДолжности = Новый ФорматированнаяСтрока(МассивСтрок,,,,"ОткрытьДолжности");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьМинимальногоВозраста(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"МинимальныйВозраст",
		"Доступность",
		Форма.ОграничиватьМинимальныйВозраст);
		
	Если Не Форма.ОграничиватьМинимальныйВозраст Тогда
		Форма.Объект.МинимальныйВозраст = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьМаксимальногоВозраста(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"МаксимальныйВозраст",
		"Доступность",
		Форма.ОграничиватьМаксимальныйВозраст);
		
	Если Не Форма.ОграничиватьМаксимальныйВозраст Тогда
		Форма.Объект.МаксимальныйВозраст = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьМинимальногоСтажа(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"МинимальныйСтажЛет",
		"Доступность",
		Форма.ОграничиватьМинимальныйСтаж);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"МинимальныйСтажМесяцев",
		"Доступность",
		Форма.ОграничиватьМинимальныйСтаж);
		
	Если Не Форма.ОграничиватьМинимальныйСтаж Тогда
		Форма.МинимальныйСтажЛет = 0;
		Форма.МинимальныйСтажМесяцев = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьМаксимальногоСтажа(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"МаксимальныйСтажЛет",
		"Доступность",
		Форма.ОграничиватьМаксимальныйСтаж);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"МаксимальныйСтажМесяцев",
		"Доступность",
		Форма.ОграничиватьМаксимальныйСтаж);
		
	Если Не Форма.ОграничиватьМаксимальныйСтаж Тогда
		Форма.МаксимальныйСтажЛет = 0;
		Форма.МаксимальныйСтажМесяцев = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементовНазначения()
	
	ЭтоНазначениеНаКатегориюГруппу = Объект.Назначение =
		ПредопределенноеЗначение("Перечисление.НазначенияКадровогоРезерва.КатегорияГруппаДолжностей");
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаТипПозиции", "Видимость",
		Не ЭтоНазначениеНаКатегориюГруппу);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаГосударственнаяСлужба",
		"Видимость", ЭтоНазначениеНаКатегориюГруппу);
		
	Если ЭтоНазначениеНаКатегориюГруппу Тогда
		Возврат;
	КонецЕсли;
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПозицияШтатногоРасписания", "Видимость",
		Объект.Назначение = ПредопределенноеЗначение("Перечисление.НазначенияКадровогоРезерва.ПозицияШтатногоРасписания"));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ИнфоДолжности", "Видимость",
		Объект.Назначение = ПредопределенноеЗначение("Перечисление.НазначенияКадровогоРезерва.ГруппаКадровогоРезерва"));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПрофильДолжности", "Видимость",
		Объект.Назначение = ПредопределенноеЗначение("Перечисление.НазначенияКадровогоРезерва.ГруппаКадровогоРезерва"));
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНаименованиеНаСервере()
	
	НаименованиеПоПозицииЕсть = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПредыдущаяПозицияШтатногоРасписания,
		"Наименование");
	Если Врег(НаименованиеПоПозицииЕсть) = Врег(Объект.Наименование) Или ПустаяСтрока(Объект.Наименование) Тогда
		Объект.Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ПозицияШтатногоРасписания, "Наименование");
	КонецЕсли;
	ПредыдущаяПозицияШтатногоРасписания = Объект.ПозицияШтатногоРасписания;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоставитьРейтингНаКлиенте(Рейтинг)
	
	ТекущиеДанные = Элементы.СписокРезервистов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПоставитьРейтингНаСервере(Объект.Ссылка, ТекущиеДанные.УчастникКадровогоРезерва, Рейтинг);
	Элементы.СписокРезервистов.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ПоставитьРейтингНаСервере(ПозицияРезерва, УчастникКадровогоРезерва, Рейтинг)
	КадровыйРезерв.ПоставитьРейтинг(ПозицияРезерва, УчастникКадровогоРезерва, Рейтинг);
КонецПроцедуры

&НаСервере
Функция АдресДолжностей()
	Возврат ПоместитьВоВременноеХранилище(Объект.Должности.Выгрузить(), Новый УникальныйИдентификатор);
КонецФункции

&НаСервере
Процедура ЗагрузитьДолжностиНаСервере(Адрес)
	
	ДолжностиПодразделений = ПолучитьИзВременногоХранилища(Адрес);
	
	Объект.Должности.Очистить();
	Объект.Подразделения.Очистить();
	
	Для Каждого СтрокаДолжность Из ДолжностиПодразделений Цикл
		НоваяДолжность = Объект.Должности.Добавить();
		НоваяДолжность.Должность = СтрокаДолжность.Должность;
		Для Каждого СтрокаПодразделения Из СтрокаДолжность.Подразделения Цикл
			НовоеПодразделение = Объект.Подразделения.Добавить();
			НовоеПодразделение.Должность = СтрокаДолжность.Должность;
			НовоеПодразделение.Подразделение = СтрокаПодразделения.Значение;
		КонецЦикла;
	КонецЦикла;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СписокУжеСозданныхПозицийШтатногоРасписанияНаСервере(НеУчитываяСсылку)
	Возврат КадровыйРезерв.СписокКлючевыхПозицийШтатногоРасписания(НеУчитываяСсылку);
КонецФункции

&НаСервереБезКонтекста
Функция АдресДанныхВХранилище(ДанныеДляХранилища)
	Возврат ПоместитьВоВременноеХранилище(ДанныеДляХранилища, Новый УникальныйИдентификатор);
КонецФункции

&НаКлиенте
Процедура УстановитьПодсказкуПоляПозицияШтатногоРасписания(ВыбранноеЗначение)

	СписокПозиций = СписокУжеСозданныхПозицийШтатногоРасписанияНаСервере(Объект.Ссылка);
	УжеЕстьТакаяПозиция = СписокПозиций.Найти(ВыбранноеЗначение) <> Неопределено;
	Если УжеЕстьТакаяПозиция Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"ПозицияШтатногоРасписания",
			"Подсказка",
			НСтр("ru ='На данную позицию штатного расписания уже заведен кадровый резерв'"));
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ПозицияШтатногоРасписания",
		"ОтображениеПодсказки",
		?(УжеЕстьТакаяПозиция, ОтображениеПодсказки.ОтображатьСнизу, ОтображениеПодсказки.Нет));
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьФлагиОграничителиВозраста(Форма)

	ОбъектФормы = Форма.Объект;
	
	Форма.ОграничиватьМинимальныйВозраст = ЗначениеЗаполнено(ОбъектФормы.МинимальныйВозраст);
	Форма.ОграничиватьМаксимальныйВозраст = ЗначениеЗаполнено(ОбъектФормы.МаксимальныйВозраст);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьФлагиОграничителиОбразования(Форма)

	ОбъектФормы = Форма.Объект;
	Форма.ОграничиватьОбразование = ЗначениеЗаполнено(ОбъектФормы.ВидОбразования)
		Или ЗначениеЗаполнено(ОбъектФормы.Специальность);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьФлагиОграничителиСтажа(Форма)

	ОбъектФормы = Форма.Объект;
	Форма.ОграничиватьМинимальныйСтаж = ЗначениеЗаполнено(ОбъектФормы.ВидСтажа)
		И (ЗначениеЗаполнено(Форма.МинимальныйСтажЛет) Или ЗначениеЗаполнено(Форма.МинимальныйСтажМесяцев));
	Форма.ОграничиватьМаксимальныйСтаж = ЗначениеЗаполнено(ОбъектФормы.ВидСтажа)
		И (ЗначениеЗаполнено(Форма.МаксимальныйСтажЛет) Или ЗначениеЗаполнено(Форма.МаксимальныйСтажМесяцев));

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьОбразования(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"ВидОбразования",
		"Доступность",
		Форма.ОграничиватьОбразование);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"Специальность",
		"Доступность",
		Форма.ОграничиватьОбразование);
		
	Если Не Форма.ОграничиватьОбразование Тогда
		Форма.Объект.ВидОбразования = ПредопределенноеЗначение("Справочник.ВидыОбразованияФизическихЛиц.ПустаяСсылка");
		Форма.Объект.Специальность = ПредопределенноеЗначение("Справочник.КлассификаторСпециальностейПоОбразованию.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьОграничителейСтажа(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"ОграничиватьМинимальныйСтаж",
		"Доступность",
		ЗначениеЗаполнено(Форма.Объект.ВидСтажа));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"ОграничиватьМаксимальныйСтаж",
		"Доступность",
		ЗначениеЗаполнено(Форма.Объект.ВидСтажа));
		
	Если Не ЗначениеЗаполнено(Форма.Объект.ВидСтажа) Тогда
		Форма.ОграничиватьМинимальныйСтаж = Ложь;
		Форма.ОграничиватьМаксимальныйСтаж = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУстановленныеПараметры(ПараметрыФормы)

	ДанныеТребований = Новый Структура;
	
	ДанныеТребований.Вставить("ОграничиватьМинимальныйВозраст", ОграничиватьМинимальныйВозраст);
	ДанныеТребований.Вставить("МинимальныйВозраст", Объект.МинимальныйВозраст);
	ДанныеТребований.Вставить("ОграничиватьМаксимальныйВозраст", ОграничиватьМаксимальныйВозраст);
	ДанныеТребований.Вставить("МаксимальныйВозраст", Объект.МаксимальныйВозраст);
	ДанныеТребований.Вставить("ОграничиватьОбразование", ОграничиватьОбразование);
	ДанныеТребований.Вставить("ВидОбразования", Объект.ВидОбразования);
	ДанныеТребований.Вставить("Специальность", Объект.Специальность);
	ДанныеТребований.Вставить("ВидСтажа", Объект.ВидСтажа);
	ДанныеТребований.Вставить("ОграничиватьМинимальныйСтаж", ОграничиватьМинимальныйСтаж);
	ДанныеТребований.Вставить("МинимальныйСтажЛет", МинимальныйСтажЛет);
	ДанныеТребований.Вставить("МинимальныйСтажМесяцев", МинимальныйСтажМесяцев);
	ДанныеТребований.Вставить("ОграничиватьМаксимальныйСтаж", ОграничиватьМаксимальныйСтаж);
	ДанныеТребований.Вставить("МаксимальныйСтажЛет", МаксимальныйСтажЛет);
	ДанныеТребований.Вставить("МаксимальныйСтажМесяцев", МаксимальныйСтажМесяцев);
	
	ПараметрыФормы.Вставить("ДанныеТребований", ДанныеТребований);

КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыСпискаРезервистов()

	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		СписокРезервистов,
		"Кандидат",
		НСтр("ru = 'Кандидат'"),
		Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		СписокРезервистов,
		"ЗачисленВРезерв",
		НСтр("ru = 'Зачислен в резерв'"),
		Истина);
		
КонецПроцедуры

&НаСервере
Процедура ПриПолученииДанныхНаСервере()
	
	КадровыйРезервФормы.СоздатьКомандыФормыКадровогоРезерва(ЭтотОбъект);
	КадровыйРезервФормы.СоздатьЭлементыФормыКомандыКадровогоРезерва(ЭтотОбъект, Элементы.ГруппаКомандКадровогоРезерва);
	
	КадровыйРезервФормы.СоздатьКомандыРейтинга(ЭтотОбъект);
	КадровыйРезервФормы.СоздатьЭлементыФормыКомандыРейтинга(ЭтотОбъект, Элементы.Рейтинг);

	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.КадровыйРезерв.КадровыйРезервГосслужащих") Тогда
		МодульКадровыйРезервГосслужащих = ОбщегоНазначения.ОбщийМодуль("КадровыйРезервГосслужащих");
		МодульКадровыйРезервГосслужащих.ДополнитьФормуЭлементаСправочникаКадровыйРезерв(ЭтотОбъект);
		МодульКадровыйРезервГосслужащих.ПрочитатьДополнительныеДанныеКадровогоРезерва(ЭтотОбъект);
	КонецЕсли;
	
	ЗаполнитьВторичныеРеквизитыФормы();
	УстановитьПараметрыСпискаРезервистов();
	
	ХарактеристикиПерсоналаФормы.ПрочитатьХарактеристикиВТаблицы(Объект.ХарактеристикиПерсонала, Характеристики,
		ЗначенияХарактеристики);
	ХарактеристикиПерсоналаФормы.ЗагрузитьРежимОтображенияПоКомпетенциям("ОтображениеПоКомпетенциямКадровогоРезерва",
		Элементы.ХарактеристикиПерсоналаПоКомпетенциям);
	ЗаполнитьДеревоХарактеристикНаСервере();
	
	ОбучениеРазвитиеФормы.СоздатьИЗаполнитьРеквизитыПланаОбучения(ЭтотОбъект);
	
	УстановитьСвойстваЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвойстваЭлементовФормы()

	УстановитьВидимостьЭлементовНазначения();
	УстановитьСвойстваЭлементовХарактеристикПерсонала(ЭтотОбъект);
	УстановитьСвойстваРеквизитовТребований();
	
	Если ПросмотрСостава Тогда
		Элементы.ГруппаСтраниц.ТекущаяСтраница = Элементы.РезервистыСтраница;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДеревоХарактеристикНаКлиенте(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт

	ЗаполнитьДеревоХарактеристикНаСервере();
	РазвернутьДерево();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоХарактеристикНаСервере()

	ХарактеристикиПерсоналаФормы.СохранитьРежимОтображенияПоКомпетенциям("ОтображениеПоКомпетенциямКадровогоРезерва",
		Элементы.ХарактеристикиПерсоналаПоКомпетенциям);
	
	Если Не Элементы.ХарактеристикиПерсоналаПоКомпетенциям.Пометка Тогда
		Возврат;
	КонецЕсли;
	
	ХарактеристикиДерево = РеквизитФормыВЗначение("ДеревоХарактеристик");
	ХарактеристикиПерсоналаФормы.ЗаполнитьДеревоХарактеристик(Характеристики, ХарактеристикиДерево, Истина);
	ЗначениеВРеквизитФормы(ХарактеристикиДерево, "ДеревоХарактеристик");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДействияСотрудниковЗавершение(РезультатВопроса, ДополнительныеПараметры = Неопределено) Экспорт

	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Характеристики.Очистить();
	ЗначенияХарактеристики.Очистить();
	ЗаполнитьДействияСотрудниковНаСервере();
	
	Модифицированность = Истина;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДействияСотрудниковНаСервере()
	
	Запрос = Новый Запрос;
	Если Объект.Назначение = Перечисления.НазначенияКадровогоРезерва.ГруппаКадровогоРезерва
		И ЗначениеЗаполнено(Объект.ПрофильДолжности) Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПрофилиДолжностейДействияСотрудников.ДействиеСотрудника КАК ДействиеСотрудника
			|ИЗ
			|	Справочник.ПрофилиДолжностей.ДействияСотрудников КАК ПрофилиДолжностейДействияСотрудников
			|ГДЕ
			|	ПрофилиДолжностейДействияСотрудников.Ссылка = &ПрофильДолжности";
		Запрос.УстановитьПараметр("ПрофильДолжности", Объект.ПрофильДолжности);
	Иначе
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ПрофилиДолжностейДействияСотрудников.ДействиеСотрудника КАК ДействиеСотрудника
			|ИЗ
			|	Справочник.ПрофилиДолжностей.ДействияСотрудников КАК ПрофилиДолжностейДействияСотрудников
			|ГДЕ
			|	ПрофилиДолжностейДействияСотрудников.Ссылка.Должность В(&СписокДолжностей)";
		Запрос.УстановитьПараметр("СписокДолжностей", ДолжностиПозиции());
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаДействий = РезультатЗапроса.Выгрузить();
	Объект.ДействияСотрудников.Загрузить(ТаблицаДействий);
	
	ЗаполнитьХарактеристикиСотрудникаНаСервере();
	
КонецПроцедуры

// Возвращаемое значение:
//  Массив из СправочникСсылка.Должности
&НаСервере
Функция ДолжностиПозиции()

	Если Объект.Назначение = ПредопределенноеЗначение("Перечисление.НазначенияКадровогоРезерва.ПозицияШтатногоРасписания") Тогда
		Должность = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ПозицияШтатногоРасписания, "Должность");
		Должности = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Должность);
	ИначеЕсли Объект.Назначение = ПредопределенноеЗначение("Перечисление.НазначенияКадровогоРезерва.ГруппаКадровогоРезерва") Тогда
		Должности = Объект.Должности.Выгрузить(, "Должность").ВыгрузитьКолонку("Должность");
	ИначеЕсли Объект.Назначение = ПредопределенноеЗначение("Перечисление.НазначенияКадровогоРезерва.КатегорияГруппаДолжностей") Тогда
		Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.КадровыйРезерв.КадровыйРезервГосслужащих") Тогда
			МодульКадровыйРезервГосслужащих = ОбщегоНазначения.ОбщийМодуль("КадровыйРезервГосслужащих");
			Должности = МодульКадровыйРезервГосслужащих.ДолжностиПоКатегорииИГруппеПозицииКадрровогоРезерва(ЭтотОбъект);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Должности;

КонецФункции

&НаКлиенте
Процедура ОткрытьПодборФункций()
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ХарактеристикаПерсонала", Объект.Ссылка);
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	ПараметрыФормы.Вставить("АдресПодобранных", АдресПодобранныхФункций());
	
	ОткрытьФорму("Справочник.ДействияСотрудников.Форма.ФормаСписка", ПараметрыФормы, Элементы.ДействияСотрудников);
	
КонецПроцедуры

&НаСервере
Функция АдресПодобранныхФункций()
	Возврат ПоместитьВоВременноеХранилище(Объект.ДействияСотрудников.Выгрузить().ВыгрузитьКолонку("ДействиеСотрудника"));
КонецФункции

&НаКлиенте
Процедура РазвернутьДерево(Развернуть = Истина)

	Для каждого СтрокаДерева Из ДеревоХарактеристик.ПолучитьЭлементы() Цикл
		Элементы.ДеревоХарактеристик.Развернуть(СтрокаДерева.ПолучитьИдентификатор(), Развернуть);
	КонецЦикла; 

КонецПроцедуры

&НаСервере
Функция ПодразделенияДолжностей()
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(Объект.Подразделения.Выгрузить());
КонецФункции

#Область ДобавлениеХарактеристик

&НаСервере
Процедура ДобавитьХарактеристикиИзДействийНаСервере(МассивДобавленныхДействий) Экспорт
	
	ДобавляемыеХарактеристики = ХарактеристикиПерсонала.МассивСтруктурХарактеристикСоЗначениямиИзДействий(
		МассивДобавленныхДействий);
	ХарактеристикиПерсоналаФормы.ДобавитьХарактеристикиСоЗначениями(Характеристики, ЗначенияХарактеристики,
		ДобавляемыеХарактеристики);
	
	ЗаполнитьДеревоХарактеристикНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьХарактеристикиИзДействийНаКлиентеЗавершение() Экспорт 
	РазвернутьДерево();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьХарактеристикиПерсоналаНаКлиенте(НовыеХарактеристики, ДополнительныеПараметры = Неопределено) Экспорт
	ДобавитьХарактеристикиПерсоналаНаСервере(НовыеХарактеристики, ДополнительныеПараметры);
КонецПроцедуры

&НаСервере
Процедура ДобавитьХарактеристикиПерсоналаНаСервере(НовыеХарактеристики, ДополнительныеПараметры)
	ХарактеристикиПерсоналаФормы.ДобавитьХарактеристикиВТабличнуюЧасть(ЭтотОбъект, НовыеХарактеристики,
		ДополнительныеПараметры);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьХарактеристикиСотрудникаНаСервере()
	
	Запрос = Новый Запрос;
	Если Объект.Назначение = Перечисления.НазначенияКадровогоРезерва.ГруппаКадровогоРезерва
		И ЗначениеЗаполнено(Объект.ПрофильДолжности) Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПрофилиДолжностейХарактеристикиПерсонала.Характеристика,
			|	ПрофилиДолжностейХарактеристикиПерсонала.Значение,
			|	ПрофилиДолжностейХарактеристикиПерсонала.Вес,
			|	ПрофилиДолжностейХарактеристикиПерсонала.ТребуетсяПроверка,
			|	ПрофилиДолжностейХарактеристикиПерсонала.ТребуетсяОбучение,
			|	ПрофилиДолжностейХарактеристикиПерсонала.ВесЗначения
			|ИЗ
			|	Справочник.ПрофилиДолжностей.ХарактеристикиПерсонала КАК ПрофилиДолжностейХарактеристикиПерсонала
			|ГДЕ
			|	ПрофилиДолжностейХарактеристикиПерсонала.Ссылка = &ПрофильДолжности";
		Запрос.УстановитьПараметр("ПрофильДолжности", Объект.ПрофильДолжности);
	Иначе
		Запрос.Текст =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ПрофилиДолжностейХарактеристикиПерсонала.Характеристика,
			|	ПрофилиДолжностейХарактеристикиПерсонала.Значение,
			|	ПрофилиДолжностейХарактеристикиПерсонала.Вес,
			|	ПрофилиДолжностейХарактеристикиПерсонала.ТребуетсяПроверка,
			|	ПрофилиДолжностейХарактеристикиПерсонала.ТребуетсяОбучение,
			|	ПрофилиДолжностейХарактеристикиПерсонала.ВесЗначения
			|ИЗ
			|	Справочник.ПрофилиДолжностей.ХарактеристикиПерсонала КАК ПрофилиДолжностейХарактеристикиПерсонала
			|ГДЕ
			|	ПрофилиДолжностейХарактеристикиПерсонала.Ссылка.Должность В (&СписокДолжностей)";
		Запрос.УстановитьПараметр("СписокДолжностей", ДолжностиПозиции());
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	МассивСтруктурХарактеристик = Новый Массив;
	Пока Выборка.Следующий() Цикл
		СтруктураХарактеристик = ХарактеристикиПерсонала.ОписаниеСтруктурыХарактеристик();
		ЗаполнитьЗначенияСвойств(СтруктураХарактеристик, Выборка);
		МассивСтруктурХарактеристик.Добавить(СтруктураХарактеристик);
	КонецЦикла;
	
	ХарактеристикиПерсоналаФормы.ДобавитьХарактеристикиСоЗначениями(Характеристики, ЗначенияХарактеристики,
		МассивСтруктурХарактеристик)

КонецПроцедуры

#КонецОбласти

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСвойстваЭлементовХарактеристикПерсонала(Форма)

	ХарактеристикиПерсоналаКлиентСервер.УстановитьВидимостьГруппХарактеристикПерсонала(
		Форма, Форма.Элементы.ХарактеристикиПерсоналаПоКомпетенциям);
		
	ХарактеристикиПерсоналаКлиентСервер.УстановитьДоступностьКомандПанелиХарактеристикПерсонала(
		Форма, Форма.Элементы.ХарактеристикиПерсоналаПоКомпетенциям);
		
	ХарактеристикиПерсоналаКлиентСервер.УстановитьВидимостьГруппКомандВКоманднойПанелиХарактеристик(
		Форма, Форма.Элементы.ХарактеристикиПерсоналаПоКомпетенциям);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьСообщенияПользователю()

	Сообщения = ПолучитьСообщенияПользователю(Ложь);
	
	Для Каждого Сообщение Из Сообщения Цикл
		Если СтрНайти(Сообщение.Поле, "МинимальныйСтажМесяцев") Тогда
			Сообщение.Поле = "";
			Сообщение.ПутьКДанным = "МинимальныйСтажЛет";
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#Область ПрограммаОбучения

&НаСервере
Процедура ПересоздатьКолонкиПериодовПрограммыОбучения() Экспорт

	ОбучениеРазвитиеФормы.УдалитьЭлементыКолонкиПериодовПлана(ЭтотОбъект);
	ОбучениеРазвитиеФормы.СоздатьКолонкиПериодовПрограммыОбучения(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПрограммуОбученияНаКлиенте(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	ЗагрузитьПрограммуОбученияНаСервере(Результат, ДополнительныеПараметры);
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПрограммуОбученияНаСервере(Результат, ДополнительныеПараметры)
	ОбучениеРазвитиеФормы.ЗагрузитьПрограммуОбучения(ЭтотОбъект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПрограммуОбученияПоПрофилюЗавершение(РезультатВопроса = Неопределено,
	ДополнительныеПараметры = Неопределено) Экспорт

	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПрограммуОбученияПоПрофилюНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПрограммуОбученияПоПрофилюНаСервере()
	
	Объект.ПрограммаОбучения.Очистить();
	
	Профиль = Справочники.ПрофилиДолжностей.ПустаяСсылка();
	ДанныеПрофиля = Новый Структура;
	ДанныеПрофиля.Вставить("ПродолжительностьПланаОбучения", 0);
	ДанныеПрофиля.Вставить("РазмерностьПродолжительностиПланаОбучения", Перечисления.Периодичность.ПустаяСсылка());
	
	РеквизитыПрофиля = "ПродолжительностьПланаОбучения, РазмерностьПродолжительностиПланаОбучения";
	Если ЗначениеЗаполнено(Объект.ПрофильДолжности) Тогда
		Профиль = Объект.ПрофильДолжности;
		ЗаполнитьЗначенияСвойств(ДанныеПрофиля, ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Профиль, РеквизитыПрофиля));
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ПрофилиДолжностей.Ссылка КАК Профиль,
			|	ПрофилиДолжностей.ПродолжительностьПланаОбучения КАК ПродолжительностьПланаОбучения,
			|	ПрофилиДолжностей.РазмерностьПродолжительностиПланаОбучения КАК РазмерностьПродолжительностиПланаОбучения
			|ИЗ
			|	Справочник.ПрофилиДолжностей КАК ПрофилиДолжностей
			|ГДЕ
			|	ПрофилиДолжностей.Должность В(&СписокДолжностей)
			|;";
		Запрос.УстановитьПараметр("СписокДолжностей", ДолжностиПозиции());
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			Профиль = Выборка.Профиль;
			ЗаполнитьЗначенияСвойств(ДанныеПрофиля, Выборка, РеквизитыПрофиля);
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Объект, ДанныеПрофиля);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПрофилиДолжностейПрограммаОбучения.Мероприятие КАК Мероприятие,
		|	ПрофилиДолжностейПрограммаОбучения.Ответственный КАК Ответственный,
		|	ПрофилиДолжностейПрограммаОбучения.Начало КАК Начало,
		|	ПрофилиДолжностейПрограммаОбучения.Окончание КАК Окончание
		|ИЗ
		|	Справочник.ПрофилиДолжностей.ПрограммаОбучения КАК ПрофилиДолжностейПрограммаОбучения
		|ГДЕ
		|	ПрофилиДолжностейПрограммаОбучения.Ссылка = &Профиль";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	РезультатЗапроса = Запрос.Выполнить();
	
	ПересоздатьКолонкиПериодовПрограммыОбучения();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Объект.ПрограммаОбучения.Добавить(), Выборка);
	КонецЦикла;
	
	ОбучениеРазвитиеФормы.ЗаполнитьВторичныеРеквизитыПрограммыОбучения(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВторичныеДанныеОбученияНаСервере(ИдентификаторТекущейСтроки)
	ОбучениеРазвитиеФормы.ЗаполнитьУчебныеЧасыПланаОбучения(ЭтотОбъект, ИдентификаторТекущейСтроки);
	ОбучениеРазвитиеФормы.ЗаполнитьОтветственногоВСтрокеПрограммыОбучения(ЭтотОбъект, ИдентификаторТекущейСтроки);
КонецПроцедуры

&НаСервере
Функция АдресХарактеристикПерсонала()
	Возврат ПоместитьВоВременноеХранилище(Характеристики.Выгрузить(, "Характеристика,КартинкаВида"),
		УникальныйИдентификатор);
КонецФункции

&НаСервере
Функция АдресПрограммыОбучения()
	Возврат ПоместитьВоВременноеХранилище(Объект.ПрограммаОбучения.Выгрузить(, "Мероприятие,Ответственный"),
		УникальныйИдентификатор);
КонецФункции

#КонецОбласти

#КонецОбласти
